# Advanced SQL Queries

We are going to learn Joins, grouping and aggrgation with a small project of **School Management Database**. Which will contain tables `students`, `courses` and `enrollments`

1. Create a new database

In [41]:
import sqlite3

In [51]:
# Create the database and connect
conn = sqlite3.connect('School_Mngt.db')
cursor = conn.cursor()

In [53]:
import os

2. See the list of Databases

In [55]:
# List all .db files in the current directory
databases = [f for f in os.listdir() if f.endswith('.db')]
print("Databases:", databases)

Databases: ['sample_database.db', 'school.db', 'school_management.db', 'School_Mngt.db', 'student_database.db']

3. Create tables `students`, `courses`, `enrollments`, `teachers` and `departments`

In [57]:
# Create students table
cursor.execute('''
CREATE TABLE IF NOT EXISTS students (
    student_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    gender TEXT
);
''')

# Create courses table
cursor.execute('''
CREATE TABLE IF NOT EXISTS courses (
    course_id INTEGER PRIMARY KEY,
    course_name TEXT NOT NULL,
    course_duration TEXT
);
''')

# Create enrollments table with the new grade column
cursor.execute('''
CREATE TABLE IF NOT EXISTS enrollments (
    enrollment_id INTEGER PRIMARY KEY,
    student_id INTEGER,
    course_id INTEGER,
    grade TEXT,
    FOREIGN KEY (student_id) REFERENCES students (student_id),
    FOREIGN KEY (course_id) REFERENCES courses (course_id)
);
''')

# Commit changes and close the connection
conn.commit()
print("Tables created successfully.")

Tables created successfully.

In [109]:
# Create teachers table
cursor.execute('''
CREATE TABLE IF NOT EXISTS teachers (
    teacher_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department_id INTEGER,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);
''')

# Create departments table
cursor.execute('''
CREATE TABLE IF NOT EXISTS departments (
    department_id INTEGER PRIMARY KEY,
    department_name TEXT NOT NULL
);
''')
# Commit changes and close the connection
conn.commit()
print("Tables created successfully.")

Tables created successfully.

4. List the tables

In [111]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

print("List of Tables:")
for table in tables:
    print(table[0])

List of Tables:
students
courses
enrollments
teachers
departments

5. Inset sample data into tables

In [63]:
# Insert sample data into students table
students_data = [
    (1, 'Aarav', 21, 'Male'),
    (2, 'Isha', 22, 'Female'),
    (3, 'Rohit', 23, 'Male'),
    (4, 'Neha', 20, 'Female'),
    (5, 'Amit', 22, 'Male'),
    (6, 'Priya', 21, 'Female'),
    (7, 'Kunal', 24, 'Male'),
    (8, 'Sita', 23, 'Female'),
    (9, 'Arjun', 20, 'Male'),
    (10, 'Radha', 22, 'Female')
]
cursor.executemany('INSERT INTO students (student_id, name, age, gender) VALUES (?, ?, ?, ?)', students_data)

# Insert sample data into courses table
courses_data = [
    (1, 'Mathematics', '3 Months'),
    (2, 'Physics', '4 Months'),
    (3, 'Chemistry', '2 Months'),
    (4, 'Biology', '3 Months'),
    (5, 'Computer Science', '6 Months')
]
cursor.executemany('INSERT INTO courses (course_id, course_name, course_duration) VALUES (?, ?, ?)', courses_data)

# Insert sample data into enrollments table
enrollments_data = [
    (1, 1, 1, 'A'),
    (2, 2, 2, 'B'),
    (3, 3, 3, 'C'),
    (4, 4, 1, 'B'),
    (5, 5, 2, 'A'),
    (6, 6, 5, 'A'),
    (7, 7, 4, 'B'),
    (8, 8, 3, 'C'),
    (9, 9, 5, 'B'),
    (10, 10, 1, 'A')
]
cursor.executemany('INSERT INTO enrollments (enrollment_id, student_id, course_id, grade) VALUES (?, ?, ?, ?)', enrollments_data)

# Commit the inserts
conn.commit()
print("Sample data inserted successfully.")

Sample data inserted successfully.

In [113]:
# Insert sample data into departments table
departments_data = [
    (1, 'Mathematics'),
    (2, 'Physics'),
    (3, 'Chemistry'),
    (4, 'Computer Science'),
    (5, 'Biology')
]
cursor.executemany('INSERT INTO departments (department_id, department_name) VALUES (?, ?)', departments_data)

# Insert sample data into teachers table
teachers_data = [
    (1, 'Dr. Sharma', 1),
    (2, 'Dr. Rao', 2),
    (3, 'Dr. Mehta', 3),
    (4, 'Dr. Iyer', 4),
    (5, 'Dr. Gupta', None)  # No department assigned
]
cursor.executemany('INSERT INTO teachers (teacher_id, name, department_id) VALUES (?, ?, ?)', teachers_data)

# Commit the inserts
conn.commit()
print("Teachers and departments data inserted successfully.")

Teachers and departments data inserted successfully.

6. Display the inserted data.

In [65]:
# Query and display the students table
cursor.execute("SELECT * FROM students;")
students = cursor.fetchall()
print("Students Data:")
for students in students_data:
    print(students)

# Query and display the courses table
cursor.execute("SELECT * FROM courses;")
courses = cursor.fetchall()
print("Courses Data:")
for courses in courses_data:
    print(courses)

# Query and display the enrollments table
cursor.execute("SELECT * FROM enrollments;")
enrollments = cursor.fetchall()
print("Enrollments Data:")
for enrollments in enrollments_data:
    print(enrollments)

Students Data:
(1, 'Aarav', 21, 'Male')
(2, 'Isha', 22, 'Female')
(3, 'Rohit', 23, 'Male')
(4, 'Neha', 20, 'Female')
(5, 'Amit', 22, 'Male')
(6, 'Priya', 21, 'Female')
(7, 'Kunal', 24, 'Male')
(8, 'Sita', 23, 'Female')
(9, 'Arjun', 20, 'Male')
(10, 'Radha', 22, 'Female')
Courses Data:
(1, 'Mathematics', '3 Months')
(2, 'Physics', '4 Months')
(3, 'Chemistry', '2 Months')
(4, 'Biology', '3 Months')
(5, 'Computer Science', '6 Months')
Enrollments Data:
(1, 1, 1, 'A')
(2, 2, 2, 'B')
(3, 3, 3, 'C')
(4, 4, 1, 'B')
(5, 5, 2, 'A')
(6, 6, 5, 'A')
(7, 7, 4, 'B')
(8, 8, 3, 'C')
(9, 9, 5, 'B')
(10, 10, 1, 'A')

## JOIN Queries:

  - `JOINs` allow us to combine rows from two or more tables based on a related column between them.
  - `INNER JOIN`, `LEFT JOIN`, `RIGHT JOIN` (Simulated in SQLite), `FULL OUTER JOIN` (Simulated)

| Join Type        | Purpose                                              | Result                                        |
|------------------|------------------------------------------------------|-----------------------------------------------|
| **INNER JOIN**   | Returns only the matching rows from both tables       | Records with matching values only             |
| **LEFT JOIN**    | Returns all rows from the left table and matched rows from the right | Non-matching right rows will be NULL          |
| **RIGHT JOIN**   | (Not available in SQLite; achieved using LEFT JOIN in reverse) | N/A                                           |
| **FULL OUTER JOIN** | Combines all matching and non-matching rows from both tables | Not supported in SQLite directly              |
| **CROSS JOIN**   | Produces a Cartesian product of both tables           | Every combination of rows                    |

1. `INNER JOIN`: Find all students and their enrolled courses.

In [89]:
# INNER JOIN: Students and their enrolled courses
cursor.execute('''
SELECT students.name, courses.course_name, enrollments.grade
FROM enrollments
INNER JOIN students ON enrollments.student_id = students.student_id
INNER JOIN courses ON enrollments.course_id = courses.course_id;
''')
result = cursor.fetchall()

# Print the results in a readable format
print("Inner Join Result:")
for row in result:
    print(f"Name: {row[0]}, Course Name: {row[1]}, Grade: {row[2]}")

Inner Join Result:
Name: Aarav, Course Name: Mathematics, Grade: A
Name: Isha, Course Name: Physics, Grade: B
Name: Rohit, Course Name: Chemistry, Grade: C
Name: Neha, Course Name: Mathematics, Grade: B
Name: Amit, Course Name: Physics, Grade: A
Name: Priya, Course Name: Computer Science, Grade: A
Name: Kunal, Course Name: Biology, Grade: B
Name: Sita, Course Name: Chemistry, Grade: C
Name: Arjun, Course Name: Computer Science, Grade: B
Name: Radha, Course Name: Mathematics, Grade: A

2. `LEFT JOIN`: List all students and their enrollments (even if not enrolled in any course).

In [91]:
# LEFT JOIN: Students and their enrolled courses (including those without enrollments)
cursor.execute('''
SELECT students.name, courses.course_name, enrollments.grade
FROM students
LEFT JOIN enrollments ON students.student_id = enrollments.student_id
LEFT JOIN courses ON enrollments.course_id = courses.course_id;
''')
result = cursor.fetchall()

# Print the results in a readable format
print("Left Join Result:")
for row in result:
    print(f" Name: {row[0]}, Course Name: {row[1] if row[1] else 'None'}, Grade: {row[2] if row[2] else 'None'}")

Left Join Result:
 Name: Aarav, Course Name: Mathematics, Grade: A
 Name: Isha, Course Name: Physics, Grade: B
 Name: Rohit, Course Name: Chemistry, Grade: C
 Name: Neha, Course Name: Mathematics, Grade: B
 Name: Amit, Course Name: Physics, Grade: A
 Name: Priya, Course Name: Computer Science, Grade: A
 Name: Kunal, Course Name: Biology, Grade: B
 Name: Sita, Course Name: Chemistry, Grade: C
 Name: Arjun, Course Name: Computer Science, Grade: B
 Name: Radha, Course Name: Mathematics, Grade: A

3. `RIGHT JOIN`: Since SQLite doesn't directly support RIGHT JOIN, we can emulate it by swapping the tables in a LEFT JOIN.

In [117]:
# RIGHT JOIN equivalent: Departments and their assigned teachers (including departments without any teachers)
cursor.execute('''
SELECT teachers.name, departments.department_name
FROM departments
LEFT JOIN teachers ON departments.department_id = teachers.department_id;
''')
result = cursor.fetchall()

# Print the results in a readable format
print("Right Join Result (emulated using LEFT JOIN):")
for row in result:
    print(f"Name: {row[0] if row[0] else 'None'}, Department Name: {row[1]}")

Right Join Result (emulated using LEFT JOIN):
Name: Dr. Sharma, Department Name: Mathematics
Name: Dr. Rao, Department Name: Physics
Name: Dr. Mehta, Department Name: Chemistry
Name: Dr. Iyer, Department Name: Computer Science
Name: None, Department Name: Biology

4. `FULL OUTER JOIN`: SQLite does not support FULL OUTER JOIN directly, but it can be emulated using a combination of LEFT JOIN and UNION.

In [119]:
# FULL OUTER JOIN equivalent: Teachers and departments (showing teachers without departments and departments without teachers)
cursor.execute('''
SELECT teachers.name, departments.department_name
FROM teachers
LEFT JOIN departments ON teachers.department_id = departments.department_id

UNION

SELECT teachers.name, departments.department_name
FROM departments
LEFT JOIN teachers ON departments.department_id = teachers.department_id;
''')
result = cursor.fetchall()

# Print the results in a readable format
print("Full Outer Join Result (emulated):")
for row in result:
    print(f"Teacher Name: {row[0] if row[0] else 'None'}, Department Name: {row[1] if row[1] else 'None'}")

Full Outer Join Result (emulated):
Teacher Name: None, Department Name: Biology
Teacher Name: Dr. Gupta, Department Name: None
Teacher Name: Dr. Iyer, Department Name: Computer Science
Teacher Name: Dr. Mehta, Department Name: Chemistry
Teacher Name: Dr. Rao, Department Name: Physics
Teacher Name: Dr. Sharma, Department Name: Mathematics

5. `CROSS JOIN`: Returns the Cartesian product of both tables, i.e., every possible combination of students and courses.

In [106]:
# CROSS JOIN: Cartesian product of students and courses
cursor.execute('''
SELECT students.name, courses.course_name
FROM students
CROSS JOIN courses;
''')
result = cursor.fetchall()

# Print the results in a readable format
print("Cross Join Result (Cartesian Product):")
for row in result:
    print(f"Name: {row[0]}, Course Name: {row[1]}")

Cross Join Result (Cartesian Product):
Name: Aarav, Course Name: Mathematics
Name: Aarav, Course Name: Physics
Name: Aarav, Course Name: Chemistry
Name: Aarav, Course Name: Biology
Name: Aarav, Course Name: Computer Science
Name: Isha, Course Name: Mathematics
Name: Isha, Course Name: Physics
Name: Isha, Course Name: Chemistry
Name: Isha, Course Name: Biology
Name: Isha, Course Name: Computer Science
Name: Rohit, Course Name: Mathematics
Name: Rohit, Course Name: Physics
Name: Rohit, Course Name: Chemistry
Name: Rohit, Course Name: Biology
Name: Rohit, Course Name: Computer Science
Name: Neha, Course Name: Mathematics
Name: Neha, Course Name: Physics
Name: Neha, Course Name: Chemistry
Name: Neha, Course Name: Biology
Name: Neha, Course Name: Computer Science
Name: Amit, Course Name: Mathematics
Name: Amit, Course Name: Physics
Name: Amit, Course Name: Chemistry
Name: Amit, Course Name: Biology
Name: Amit, Course Name: Computer Science
Name: Priya, Course Name: Mathematics
Name: Priya, Course Name: Physics
Name: Priya, Course Name: Chemistry
Name: Priya, Course Name: Biology
Name: Priya, Course Name: Computer Science
Name: Kunal, Course Name: Mathematics
Name: Kunal, Course Name: Physics
Name: Kunal, Course Name: Chemistry
Name: Kunal, Course Name: Biology
Name: Kunal, Course Name: Computer Science
Name: Sita, Course Name: Mathematics
Name: Sita, Course Name: Physics
Name: Sita, Course Name: Chemistry
Name: Sita, Course Name: Biology
Name: Sita, Course Name: Computer Science
Name: Arjun, Course Name: Mathematics
Name: Arjun, Course Name: Physics
Name: Arjun, Course Name: Chemistry
Name: Arjun, Course Name: Biology
Name: Arjun, Course Name: Computer Science
Name: Radha, Course Name: Mathematics
Name: Radha, Course Name: Physics
Name: Radha, Course Name: Chemistry
Name: Radha, Course Name: Biology
Name: Radha, Course Name: Computer Science

## Grouping and Aggregation:

   - `GROUP BY` and `HAVING` clauses
   - Aggregate functions: `COUNT()`, `SUM()`, `AVG()`, `MIN()`, `MAX()`

1. `GROUP BY Department`: Count how many teachers are in each department

In [123]:
# GROUP BY department to count how many teachers are in each department
cursor.execute('''
SELECT departments.department_name, COUNT(teachers.teacher_id) AS teacher_count
FROM departments
LEFT JOIN teachers ON departments.department_id = teachers.department_id
GROUP BY departments.department_name;
''')
result = cursor.fetchall()

# Print the result in a readable format
print("Number of Teachers in Each Department (GROUP BY Department):")
for row in result:
    print(f"Department Name: {row[0]}, Number of Teachers: {row[1]}")

Number of Teachers in Each Department (GROUP BY Department):
Department Name: Biology, Number of Teachers: 0
Department Name: Chemistry, Number of Teachers: 1
Department Name: Computer Science, Number of Teachers: 1
Department Name: Mathematics, Number of Teachers: 1
Department Name: Physics, Number of Teachers: 1

2.  `GROUP BY` and `Aggregate Functions Together`: Calculate the average grade for each course

In [127]:
# GROUP BY course to calculate the average grade for each course
cursor.execute('''
SELECT courses.course_name, AVG(
    CASE
        WHEN enrollments.grade = 'A' THEN 4
        WHEN enrollments.grade = 'B' THEN 3
        WHEN enrollments.grade = 'C' THEN 2
        ELSE 0
    END
) AS average_grade
FROM courses
LEFT JOIN enrollments ON courses.course_id = enrollments.course_id
GROUP BY courses.course_name;
''')
result = cursor.fetchall()

# Print the result in a readable format
print("Average Grade for Each Course (GROUP BY Course):")
for row in result:
    print(f"Course Name: {row[0]}, Average Grade: {row[1]:.2f}")

Average Grade for Each Course (GROUP BY Course):
Course Name: Biology, Average Grade: 3.00
Course Name: Chemistry, Average Grade: 2.00
Course Name: Computer Science, Average Grade: 3.50
Course Name: Mathematics, Average Grade: 3.67
Course Name: Physics, Average Grade: 3.50

 3. `HAVING`: Filter the results using a HAVING clause. For example, show only courses where the average grade is greater than 2.5.

In [130]:
# GROUP BY course and use HAVING to filter courses with an average grade > 2.5
cursor.execute('''
SELECT courses.course_name, AVG(
    CASE
        WHEN enrollments.grade = 'A' THEN 4
        WHEN enrollments.grade = 'B' THEN 3
        WHEN enrollments.grade = 'C' THEN 2
        ELSE 0
    END
) AS average_grade
FROM courses
LEFT JOIN enrollments ON courses.course_id = enrollments.course_id
GROUP BY courses.course_name
HAVING average_grade > 2.5;
''')
result = cursor.fetchall()

# Print the result in a readable format
print("Courses with Average Grade Greater Than 2.5:")
for row in result:
    print(f"Course Name: {row[0]}, Average Grade: {row[1]:.2f}")

Courses with Average Grade Greater Than 2.5:
Course Name: Biology, Average Grade: 3.00
Course Name: Computer Science, Average Grade: 3.50
Course Name: Mathematics, Average Grade: 3.67
Course Name: Physics, Average Grade: 3.50

4. `COUNT()`: Count how many students are enrolled in each course

In [ ]:
# GROUP BY course to count the number of students enrolled in each course
cursor.execute('''
SELECT courses.course_name, COUNT(enrollments.student_id) AS student_count
FROM courses
LEFT JOIN enrollments ON courses.course_id = enrollments.course_id
GROUP BY courses.course_name;
''')
result = cursor.fetchall()

# Print the result in a readable format
print("Number of Students Enrolled in Each Course:")
for row in result:
    print(f"Course Name: {row[0]}, Number of Students: {row[1]}")

5. `SUM()`: Calculate the total number of courses each student is enrolled in

In [134]:
# GROUP BY student to calculate the total number of courses each student is enrolled in
cursor.execute('''
SELECT students.name, COUNT(enrollments.course_id) AS total_courses
FROM students
LEFT JOIN enrollments ON students.student_id = enrollments.student_id
GROUP BY students.name;
''')
result = cursor.fetchall()

# Print the result in a readable format
print("Total Number of Courses Each Student Is Enrolled In:")
for row in result:
    print(f"Student Name: {row[0]}, Total Courses: {row[1]}")

Total Number of Courses Each Student Is Enrolled In:
Student Name: Aarav, Total Courses: 1
Student Name: Amit, Total Courses: 1
Student Name: Arjun, Total Courses: 1
Student Name: Isha, Total Courses: 1
Student Name: Kunal, Total Courses: 1
Student Name: Neha, Total Courses: 1
Student Name: Priya, Total Courses: 1
Student Name: Radha, Total Courses: 1
Student Name: Rohit, Total Courses: 1
Student Name: Sita, Total Courses: 1

 6. `AVG()`: Calculate the average grade for each course (assuming grades are represented as A=4, B=3, C=2, etc.)
    - For this, we'll use a CASE statement to convert grades into numeric values.

In [137]:
# GROUP BY course to calculate the average grade for each course
cursor.execute('''
SELECT courses.course_name, AVG(
    CASE
        WHEN enrollments.grade = 'A' THEN 4
        WHEN enrollments.grade = 'B' THEN 3
        WHEN enrollments.grade = 'C' THEN 2
        ELSE 0
    END
) AS average_grade
FROM courses
LEFT JOIN enrollments ON courses.course_id = enrollments.course_id
GROUP BY courses.course_name;
''')
result = cursor.fetchall()

# Print the result in a readable format
print("Average Grade for Each Course:")
for row in result:
    print(f"Course Name: {row[0]}, Average Grade: {row[1]:.2f}")

Average Grade for Each Course:
Course Name: Biology, Average Grade: 3.00
Course Name: Chemistry, Average Grade: 2.00
Course Name: Computer Science, Average Grade: 3.50
Course Name: Mathematics, Average Grade: 3.67
Course Name: Physics, Average Grade: 3.50

7. `MIN()` and `MAX()`: Find the minimum and maximum grades for each course

In [144]:
# GROUP BY course to find the minimum and maximum grade
cursor.execute('''
SELECT courses.course_name,
    MIN(CASE
            WHEN enrollments.grade = 'A' THEN 4
            WHEN enrollments.grade = 'B' THEN 3
            WHEN enrollments.grade = 'C' THEN 2
            ELSE 0
        END) AS min_grade,
    MAX(CASE
            WHEN enrollments.grade = 'A' THEN 4
            WHEN enrollments.grade = 'B' THEN 3
            WHEN enrollments.grade = 'C' THEN 2
            ELSE 0
        END) AS max_grade
FROM courses
LEFT JOIN enrollments ON courses.course_id = enrollments.course_id
GROUP BY courses.course_name;
''')
result = cursor.fetchall()

# Print the result in a readable format
print("Minimum and Maximum Grades for Each Course:")
for row in result:
    print(f"Course Name: {row[0]}, Min Grade: {row[1]}, Max Grade: {row[2]}")

Minimum and Maximum Grades for Each Course:
Course Name: Biology, Min Grade: 3, Max Grade: 3
Course Name: Chemistry, Min Grade: 2, Max Grade: 2
Course Name: Computer Science, Min Grade: 3, Max Grade: 4
Course Name: Mathematics, Min Grade: 3, Max Grade: 4
Course Name: Physics, Min Grade: 3, Max Grade: 4

In [33]:
# Close the database connection
connection.close()
print("Database connection closed.")

Database connection closed.